## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/6bb2945c-e7d1-4f83-9fed-a3bb6692837f/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app_job.job will be created
  + resource "azurerm_container_app_job" "job" {
      + container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + event_stream_endpoint        = (known after apply)
      + id                           = (known after apply)
      + location                     = "australiaeast"
      + name                         = "biotrackr-fitbitapi-svc"
      + outbound_ip_addresses        = (known after apply)
      + replica_retry_limit          = 3
      + replica_timeout_in_seconds   = 600
      + resource_group_name          = "rg-biotrackr-prod-ae"
      + tags                         = {
          + "Application" = "biotrackr"
          + "Component"   = "FitBitApi"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + registries (known after apply)

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + schedule_trigger_config {
          + cron_expression          = "0 5 * * *"
          + parallelism              = 1
          + replica_completion_count = 1
        }

      + secret (known after apply)

      + secrets (known after apply)

      + template {
          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-fitbitapi-svc:526eebf1bff36d454d9d75c3c787d2427788ac51"
              + memory            = "0.5Gi"
              + name              = "biotrackr-fitbitapi-svc"

              + env {
                  + name  = "keyvaulturl"
                  + value = "https://kv-biotrackr-prod-ae.vault.azure.net/"
                }
              + env {
                  + name  = "managedidentityclientid"
                  + value = "e0077542-1278-4f86-95e5-836782e55be2"
                }
              + env {
                  + name  = "servicebusendpoint"
                  + value = "https://sb-biotrackr-prod-ae.servicebus.windows.net:443/"
                }
              + env {
                  + name  = "azureappconfigendpoint"
                  + value = "https://appconfig-biotrackr-prod-ae.azconfig.io"
                }
              + env {
                  + name  = "appinsightsconnectionstring"
                  + value = (sensitive value)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_app_job.job will be created%0A  + resource "azurerm_container_app_job" "job" {%0A      + container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"%0A      + event_stream_endpoint        = (known after apply)%0A      + id                           = (known after apply)%0A      + location                     = "australiaeast"%0A      + name                         = "biotrackr-fitbitapi-svc"%0A      + outbound_ip_addresses        = (known after apply)%0A      + replica_retry_limit          = 3%0A      + replica_timeout_in_seconds   = 600%0A      + resource_group_name          = "rg-biotrackr-prod-ae"%0A      + tags                         = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "FitBitApi"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A%0A      + identity {%0A          + identity_ids = [%0A              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ]%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + registries (known after apply)%0A%0A      + registry {%0A          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"%0A          + server   = "acrbiotrackrprodae.azurecr.io"%0A        }%0A%0A      + schedule_trigger_config {%0A          + cron_expression          = "0 5 * * *"%0A          + parallelism              = 1%0A          + replica_completion_count = 1%0A        }%0A%0A      + secret (known after apply)%0A%0A      + secrets (known after apply)%0A%0A      + template {%0A          + container {%0A              + cpu               = 0.25%0A              + ephemeral_storage = (known after apply)%0A              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-fitbitapi-svc:526eebf1bff36d454d9d75c3c787d2427788ac51"%0A              + memory            = "0.5Gi"%0A              + name              = "biotrackr-fitbitapi-svc"%0A%0A              + env {%0A                  + name  = "keyvaulturl"%0A                  + value = "https://kv-biotrackr-prod-ae.vault.azure.net/"%0A                }%0A              + env {%0A                  + name  = "managedidentityclientid"%0A                  + value = "e0077542-1278-4f86-95e5-836782e55be2"%0A                }%0A              + env {%0A                  + name  = "servicebusendpoint"%0A                  + value = "https://sb-biotrackr-prod-ae.servicebus.windows.net:443/"%0A                }%0A              + env {%0A                  + name  = "azureappconfigendpoint"%0A                  + value = "https://appconfig-biotrackr-prod-ae.azconfig.io"%0A                }%0A              + env {%0A                  + name  = "appinsightsconnectionstring"%0A                  + value = (sensitive value)%0A                }%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>